{"meta":{"title":"roseduan的个人博客","subtitle":null,"description":null,"author":"roseduan","url":"http://roseduan.github.io"},"pages":[{"title":"about","date":"2018-11-25T13:39:37.000Z","updated":"2018-11-25T14:12:32.535Z","comments":true,"path":"about/index.html","permalink":"http://roseduan.github.io/about/index.html","excerpt":"","text":"关于我 Java开发者一名，非科班出身，自学编程。喜欢Java、Python语言，热爱数据结构与算法，喜欢捣鼓新的技术，时常关注圈内热点信息。 相信可以通过自身的努力让自己变得更好，更希望在互联网行业走得更深更远。 关于学习计算机基础是我很重视的内容，计算机系统、数据结构与算法、计算机网络等，都是我长期需要学习的内容。以后的方向：转行大数据。 兴趣爱好 阅读是第一爱好，爱看文学类相关书籍，目前喜欢毛姆的书籍多一些。喜欢写作分享，技术类和感悟类都涉及，博客和公众号是目前主要的写作阵地。爱运动，喜欢足球，C罗忠粉，平时喜欢打网球。 关于城市 在成都上大学，待了四年。最向往的中国城市是上海，想要在上海扎根！ 座右铭 Only the strong survive. 联系我 你可以通过以下方式找到我： Github： https://github.com/roseduan QQ：1952479124 微信公众号："}],"posts":[{"title":"培训机构的小姐姐是如何说服你的","slug":"培训机构的小姐姐是如何说服你的","date":"2018-11-21T08:48:27.000Z","updated":"2018-11-24T09:28:39.463Z","comments":true,"path":"2018/11/21/培训机构的小姐姐是如何说服你的/","link":"","permalink":"http://roseduan.github.io/2018/11/21/培训机构的小姐姐是如何说服你的/","excerpt":"","text":"1.秋招已经接近尾声，我在成都也已经找了好多家公司面试了，但都不是很顺利。归根结底，还是自己的技术能力不够吧，在有了生存的压迫之下，自己的学习才能够有紧迫性，希望抓紧时间。但是今天我主要想说的确实另外的一件事。 2.前天到一家公司面试，说起奇怪，这家公司的地址给我的感觉跟其他的不一样，我以前面试的公司一般都是在某个写字楼，但是这家公司在一个较为低矮的房子里。我一走进去，就能看见每一层楼梯都写着“……教育，专注于培养专业技术人才……”，那一刻我就明白了，原来这公司是培训机构！ 那天还早，我又没有其他的地方可去，所以我索性就直接进去看看了。果不其然，里面有很多教室，有很多人正在上课。我跟其他的几个人在一起听了他们对公司的介绍，然后一个自称技术经理的人说要带着我们花三天时间做一个小的项目，算是对我们的一个技术检验。如果通过，就可以直接推荐去公司。 但是我下午还有其他的面试，我不打算在那里多待，就给负责人说了我下午要走。负责人说既然这样的话，那我就直接给你安排技术面试吧。我心想还不错啊，技术面试要是过了的话，就可以直接去公司了。结果，她所说的技术面试就是安排一个人给你洗脑，让你去他们的培训。 3.我很无语啊，我就这样不明所以的和她聊了一个多小时，大多数时候都是她在说。后来我总结了一下，她的套路基本上是这样的： 首先她知道，我最近在找工作，而且还不太顺利，然后她就拿出了他们的培训课程体系让我看看，我说大部分我都是学过的，但都不是很精通，有些还没学过呢。她就介绍他们的课程怎么怎么好，老师多么专业，而且他们现在还在做十二周年活动，这个月报名的话，费用会比平时少很多。但是这种套路我很熟悉了，别说这个月了，就算明年你再去报名，费用还是可以商量的。 然后她会给你说他们这里的学生的就业情况，拿到的工资基本上都是8K，9K，10K以上的，而且大部分都是非计算机专业，零基础前来培训的。她就会说，你是计算机专业的，有这方面的基础，在这里培训几个月，把自己的技术弄扎实，毕业的时候在找个好工作，完全是没问题的。 然后她会拿出他们学员跟她的微信聊天记录，基本都是就业工资的问题，让你明确她说的是没错的。她还会举几个特里来刺激你，比如某个非计算机专业的女生，学Java开发，零基础，就业工资18K，听起来实在是很诱人。她说人家一个女生都能取得这样的成就，那么一个男生就更加没有理由犹豫了。 还有的特例，比如说有个学员已经找到了工作，但是主动辞职前来培训，主要是想把自己的技术在巩固一下。所以她就给你说，就算你现在运气好，找到了一个实习的工作，但是你的压力会特别的大，这样工作下去，你的技术等各方面的能力是很难有长进的。 现在的培训机构很聪明了，都是打着招聘的幌子把你忽悠过去，然后就指出你的技术方面的问题，然后就给你洗脑。其实我心里并没有很讨厌给我稀里糊涂讲了一大堆的那位工作人员，毕竟这也是别人的工作，我得尊重一个努力对待自己工作的人，但是很可惜，她找错目标对象了。 其实我心里对培训机构并不排斥，因为这也是一条出路，不然就不会有那么多的培训机构产生了。 4.我在那里还遇到一个人，他是前来了解IT这行业的。跟他简单聊了几句，才知道他是12年毕业的，这几年没怎么工作，又没有什么一技之长，所以对未来十分的迷茫。他想从事开发方面的工作，但是又碍于各种因素而畏手畏脚，比如年纪比较大了，学习的难度可能比较高等等。在他的眼里，我看到了迷茫、不知所措和对未来的恐惧。的确，在这个竞争日益激烈的社会，自身硬实力是生存下去的根本，还有认准行业很重要，俗话说，站在趋势的风口下，猪都会飞！","categories":[{"name":"无事杂谈","slug":"无事杂谈","permalink":"http://roseduan.github.io/categories/无事杂谈/"}],"tags":[{"name":"无事杂谈","slug":"无事杂谈","permalink":"http://roseduan.github.io/tags/无事杂谈/"}]},{"title":"报到贴","slug":"报到贴","date":"2018-11-19T13:40:09.000Z","updated":"2018-11-22T15:04:24.393Z","comments":true,"path":"2018/11/19/报到贴/","link":"","permalink":"http://roseduan.github.io/2018/11/19/报到贴/","excerpt":"","text":"1.说来惭愧，在去年的这个时候，我就已经想要搭建自己的博客了，并且折腾了一天，基本上完成了初步的搭建。但是我并没有使用起来，这个博客也就荒废在这里了。大概一年之后，可能是外部因素的刺激，也可能是自身的觉悟使然，让我又重新搭建起自己的博客。浪费了一年时间之后，有一种悔不当初的复杂心情，也有重新来过的轻快愉悦，在这里，我写下roseduan的个人博客的第一篇文章。 2.前段时间，我看到了公众号【码农翻身】里面的一篇文章，里面有说到写作对于一个程序员有多么的重要。具体的内容不必赘述，只想阐述其中的一点： 一个知识点学没学透彻，一个很有效的判断的方法就是你能不能够向别人讲述清楚这个知识点。很多时候，我们在学习的时候，知识在内心有个大致的概念，感觉自己弄懂了，但是要你自己表述出来，我们常常感到很困难，这就说明我们其实并没有彻底弄懂这个知识。那该怎么办，我们总不能老是拿别人来做自己的知识练习对象，‘哎哎，我今天学了数据库，我给你讲讲吧！’，刚开始别人可能还有兴趣听一听，但是长此以往没有人受得了。 所以，写作的优势就能够体现出来了。写作逼着你去思考，去总结，去想怎么把这个问题说明白。其实这就直接锻炼了我们的文字组织能力和语言表达能力。 以上，是近期直接导致我想要重新开始写博客的原因，因为这个观点戳中了我内心最真实的想法。长期以来，我接触到的这方面的东西实在不少，总是建议我们应该写作，应该坚持下去。但是碍于自己的写作意识不够和不能够更好坚持下去的缘由，我迟迟未能在这一片天地开拓出自己的空间，但现在，是时候了。 3.互联网时代的好处之一便是将一些远在天边的人和自己以某种方式相联系，让我能够从中学习到别人身上的优点，看到别人的光环，并知道别人是怎么做到这一切的。我很幸运的能够接触到一些行业内的比较厉害的人，跟我类似的也大有人在：非科班出身，自学编程，成为行业大牛，互联网大V。我从这些人身上看到了很多共同的优点，其中之一便是长期坚持写作。虽说我跟他们的差距非常的大，但这并不妨碍我在心中播下梦想的种子，因为有期待就有前进的动力。 4.我的写作经验大都是在我的公众号【roseduan】上面积累的，但是更新连续性并不是很好，经常出现较长时间的停更。而且这上面都是非技术性的文章，所以只要脑子没有打开，没有新的思考的话，就比较难长时间的更新。但是我不会放弃的，公众号与博客，将是我长期写作的地方。困难将可以预见，那就是我能不能长时间的坚持下去，还有就是初期的写作不会博得太多的关注，还有以后的时间安排问题。这些困难基本上是每个人都会遇到的，有的人中途放弃了，有的人挺下来了，这也是考验一个人最直接的方式吧。 5.我大四了，在学校已经没有课程了，仅剩的任务便是毕业论文，可以说我的大学生活基本上结束了。在不久的以后面临的便是社会的考验和职场的洗礼。对于技术人来说，初入职场需要注意些什么，需要培养哪些软技能，我已经听说了不少，无非是写作、英语、演讲、投资理财等等，却没有机会实际的感触一下。但是在大学期间从写作开始，我觉得很不错了。 ​","categories":[{"name":"无事杂谈","slug":"无事杂谈","permalink":"http://roseduan.github.io/categories/无事杂谈/"}],"tags":[{"name":"无事杂谈","slug":"无事杂谈","permalink":"http://roseduan.github.io/tags/无事杂谈/"}]}]}